a = 3           #змінна є цілим числом
a = 'spam'      #тепер вона стала строкою
a = 1.23        #а тепер вона стала число з плаваючою крапкою

x = 42
x = 'shrubery'  #звільняється пам'ять, яку займає 42
x = 3.1415      #звільняється пам'ять, яку займає 'shrubery'
x = [1, 2, 3]   #звільняється пам'ять, яку займає 3.1415

L1 = [2, 3, 4]  #змінюваний об'єкт
L2 = L1         #створює посилання на той самий об'єкт
L1[0] = 24      #зміни на місці
print(L1)       #L1 змінився
print(L2)       #L2 також змінився

L1 = [2, 3, 4]
L2 = L1[:]      #створюємо копію L1 (або list(L1), copy.copy(L1) і т.д.)
L1[0] = 24
print(L1)       #L1 змінився
print(L2)       #L2 не змінився

L = [1, 2, 3]
M = L           #M i L мають посилання на один і той самий об'єкт
print(L == M)   #перевірка чи одинакові значення
print(L is M)   #перевірка чи одинакові об'єкти

L = [1, 2, 3]
M = [1, 2, 3]   #M i L мають посилання на різні об'єкти
print(L == M)   #перевірка чи одинакові значення
print(L is M)   #об'єкти різні

X = 42
Y = 42          #мали б бути двома різними об'єктами
print(X == Y)
print(X is Y)   #як би то не було, ефект той самий, кешування в дії